//RXWTO    EXEC  PGM=IKJEFT01,COND=EVEN          
//SYSEXEC  DD  DSN=ANDREWJ.SOURCE.EXEC,DISP=SHR  
//SYSPRINT DD  SYSOUT=*                          
//SYSTSPRT DD  SYSOUT=*                          
//SYSTSIN  DD  *                                 
  %RXWTO                                         
/*                                               